# Практическое задание 1
## Задача 1
В сообщении из 1 000 символов используют алфавит из 64 символов. Каков объём информации в сообщении?

## Задача 2
Сообщение из 1024 символов занимает 1/128 мегабайта. Сколько символов в исходном алфавите?

## Задача 3
Печатая текст в кодировке UTF-16, пользователь успевает набрать 128 символов в минуту. Сколько килобайт информации будет внесено в документ в течение пяти минут?

## Задача 4
Переведите число 28 в троичную систему счисления.

## Задача 5
RGB-картинка занимает ~72 килобайта. Каков её размер в пикселях?

## Задача 6
Опишите блок-схему перевода числа из десятичной системы в двоичную.